In [1]:
'I remember {0:.3} or {0:.3%} of, the days'.format(7/67890)

'I remember 0.000103 or 0.010% of, the days'

In [6]:
"My userID is {0:06d}".format(12)

'My userID is 000012'

In [8]:
"My love number is %d" % 7

'My love number is 7'

In [9]:
'%(name)s is very cute, but her sleep time is %(time).2f' % {'name' : "layla", "time" : 1.1631212}

'layla is very cute, but her sleep time is 1.16'

In [10]:
name = 'layla'
month = 12
day = 19
f'{name}! happy birth day! today is {month} / {day}!'

'layla! happy birth day! today is 12 / 19!'

In [11]:
import re

In [13]:
text = '1234567890'
ax = re.match(pattern='\d{10}' , string=text)
ax

In [14]:
if(bool(ax)):
    print("match")
else:
    print("unmatch")

match

In [15]:
print(ax.start())
print(ax.end())
print(ax.span())
print(ax.group())

0
10
(0, 10)
1234567890

In [20]:
string_a = '123 4567 8901'
string_b = '(123) 456 7890'
string_c = '+1 (123) 456-7890'

In [17]:
re.match(pattern='\d{3}\s\d{4}\s\d{4}', string=string_a)

In [18]:
re.match(pattern='\(\d{3}\)\s\d{3}\s\d{4}', string=string_b)

In [21]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string=string_c)

In [23]:
ptn = re.compile('\D{9}\:\d{4}')
ptn.match('localhost:8888')

In [24]:
def exp(x):
    return x ** 2

def exp2(x, n):
    return x ** n

In [25]:
exp(10)

100

In [27]:
exp2(10, 2)

100

In [32]:
import pandas as pd

In [34]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [35]:
df['a'].apply(exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [37]:
df['a'].apply(exp2, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [39]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [40]:
printme = lambda x : print(x)

In [44]:
df.apply(printme, axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [49]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [54]:
def printx(m):
    print(m[2])

In [55]:
df.apply(printx)

30
40

a    None
b    None
dtype: object

In [72]:
df.shape[0]

3

In [73]:
def invx(m, shape):
    sum = 0
    for i in m:
        sum += i
    if(shape == 0):
        return sum / df.shape[0]
    elif(shape == 1):
        return sum / df.shape[1]

In [74]:
df.apply(invx, shape=1)

a    30.0
b    45.0
dtype: float64

In [76]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [75]:
df.apply(invx, shape=0)

a    20.0
b    30.0
dtype: float64

In [78]:
(10 + 20 + 30) / 3

20.0

In [79]:
(20 + 30 + 40) / 3

30.0

In [84]:
df.apply(invx, shape=1, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [81]:
( 10 + 20 ) / 2

15.0

In [82]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
    return sum / df.shape[1]

In [83]:
df.apply(avg_2_apply, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [85]:
import seaborn as sns

In [86]:
df = sns.load_dataset("titanic")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [92]:
getnana = lambda x : pd.isnull(x).sum()

In [91]:
def getnan(m):
    null_vec = pd.isnull(m)
    return null_vec.sum()
df.apply(getnan)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [93]:
df.apply(getnana)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [95]:
def GetPercent(msi):
    x = pd.isnull(msi).sum()
    return x / msi.size
df.apply(GetPercent)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [96]:
def GetPercent(msi):
    x = pd.isnull(msi).sum()
    return (x / msi.size) * 100
df.apply(GetPercent)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [97]:
def nonNaNa(msi):
    x = pd.isnull(msi).sum()
    return 1 - (x / msi.size)

df.apply(nonNaNa)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [99]:
def nonNaNa(msi):
    x = pd.isnull(msi).sum()
    return (1 - (x / msi.size)) * 100

df.apply(nonNaNa)

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
dtype: float64

In [101]:
df.apply(nonNaNa, axis=1)

0       93.333333
1      100.000000
2       93.333333
3      100.000000
4       93.333333
          ...
886     93.333333
887    100.000000
888     86.666667
889    100.000000
890     93.333333
Length: 891, dtype: float64

In [103]:
df.apply(GetPercent, axis=1)

0       6.666667
1       0.000000
2       6.666667
3       0.000000
4       6.666667
         ...
886     6.666667
887     0.000000
888    13.333333
889     0.000000
890     6.666667
Length: 891, dtype: float64

In [104]:
getfile = lambda x : pd.isnull(x).sum()

In [106]:
df.apply(getfile, axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [110]:
df['missing'] = df.apply(getfile, axis=1)

In [111]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

In [114]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
304,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,3
797,1,3,female,31.0,0,0,8.6833,S,Third,woman,False,NaN,Southampton,yes,True,2
428,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,3
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,3
46,0,3,male,NaN,1,0,15.5000,Q,Third,man,True,NaN,Queenstown,no,False,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
749,0,3,male,31.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
243,0,3,male,22.0,0,0,7.1250,S,Third,man,True,NaN,Southampton,no,True,2
279,1,3,female,35.0,1,1,20.2500,S,Third,woman,False,NaN,Southampton,yes,False,2
590,0,3,male,35.0,0,0,7.1250,S,Third,man,True,NaN,Southampton,no,True,2
777,1,3,female,5.0,0,0,12.4750,S,Third,child,False,NaN,Southampton,yes,True,2

In [115]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [117]:
df.groupby("year")['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [118]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [121]:
y1952 = df[df['year'] == 1952]['lifeExp'].mean()
y1957 = df[df['year'] == 1957]['lifeExp'].mean()
y1962 = df[df['year'] == 1962]['lifeExp'].mean()
y2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [123]:
xdf = pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    '' : [y1952, y1957, y1962, y2007]
})

In [124]:
xdf

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [128]:
xs = [1952, 1957, 1962, 2007]
xs

[1952, 1957, 1962, 2007]

In [133]:
xs = [1952, 1957, 1962, 2007]
xd = []
for i in xs:
    print(i)
    xd.append(df[df['year'] == int(i)]['lifeExp'].mean())
    
df = pd.DataFrame({
    'year' : xs,
    'mean' : xd
})
df

1952

KeyError: 'lifeExp'

In [134]:
def layla_mean_funcation(data):
    sum = 0
    for i in data:
        sum += i
    return sum / len(data)

In [140]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [144]:
import numpy as np

In [145]:
df.groupby("year")['lifeExp'].agg(np.mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [141]:
df.groupby("year")['lifeExp'].agg(layla_mean_funcation)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [148]:
def my_mean_diff(values, diff_values):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    mean = sum / n
    return mean - diff_values

def ive(data, diff):
    sum = 0
    for i in data:
        sum += i
    return (sum / len(data)) - diff

df.groupby("year")['lifeExp'].agg(ive, diff=100)

year
1952   -50.942380
1957   -48.492599
1962   -46.390751
1967   -44.321710
1972   -42.352614
1977   -40.429843
1982   -38.466803
1987   -36.787387
1992   -35.839662
1997   -34.985324
2002   -34.305077
2007   -32.992577
Name: lifeExp, dtype: float64

In [149]:
df.groupby("year")['lifeExp'].agg(my_mean_diff, diff_values=100)

year
1952   -50.942380
1957   -48.492599
1962   -46.390751
1967   -44.321710
1972   -42.352614
1977   -40.429843
1982   -38.466803
1987   -36.787387
1992   -35.839662
1997   -34.985324
2002   -34.305077
2007   -32.992577
Name: lifeExp, dtype: float64

In [150]:
df.groupby("year")['lifeExp'].agg(ive, diff=df.lifeExp.mean())

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [152]:
df.groupby("year")['lifeExp'].agg([np.count_nonzero, np.mean, np.std])

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [153]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [156]:
df.groupby("year").agg({'lifeExp' : 'mean', 'pop' : 'median', 'gdpPercap' : 'median'})

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [157]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [158]:
df.count()

country      1704
continent    1704
year         1704
lifeExp      1704
pop          1704
gdpPercap    1704
dtype: int64

In [161]:
my_zscore = lambda x : (x - x.mean()) / x.std()
ux = df.groupby("year")['lifeExp'].transform(my_zscore)
ux

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [162]:
df.shape

(1704, 6)

In [163]:
ux.shape

(1704,)

In [164]:
ux.columns

AttributeError: 'Series' object has no attribute 'columns'

In [165]:
ux.info()

<class 'pandas.core.series.Series'>
RangeIndex: 1704 entries, 0 to 1703
Series name: lifeExp
Non-Null Count  Dtype
--------------  -----
1704 non-null   float64
dtypes: float64(1)
memory usage: 13.4 KB

In [166]:
ux.infex

AttributeError: 'Series' object has no attribute 'infex'

In [167]:
ux.index

RangeIndex(start=0, stop=1704, step=1)

In [169]:
df = sns.load_dataset("tips")
df = df.loc[0:9]
df

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [170]:
import random

In [172]:
np.random.permutation(df.index)

array([ 81, 159,  45, 211, 148, 188,  88, 104, 232, 184], dtype=int64)

In [180]:
random.seed(42)
from numpy import NAN
df = sns.load_dataset("tips").sample(10)
df.loc[np.random.permutation(df.index)[:4], 'total_bill'] = NAN
df

     total_bill   tip     sex smoker   day    time  size
127       14.52  2.00  Female     No  Thur   Lunch     2
131       20.27  2.83  Female     No  Thur   Lunch     2
194         NaN  4.00    Male    Yes  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2
82          NaN  1.83  Female     No  Thur   Lunch     1
49        18.04  3.00    Male     No   Sun  Dinner     2
171         NaN  3.16    Male    Yes   Sat  Dinner     2
107         NaN  4.29    Male    Yes   Sat  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
225       16.27  2.50  Female    Yes   Fri   Lunch     2

In [181]:
df.groupby("sex").count()

        total_bill  tip  smoker  day  time  size
sex
Male             2    5       5    5     5     5
Female           4    5       5    5     5     5

In [187]:
def fill_na_mean(x):
    return x.fillna(x.mean())

df['meanofsex'] = df.groupby("sex")['total_bill'].transform(fill_na_mean)
df.head(10)

     total_bill   tip     sex smoker   day    time  size  meanofsex
127       14.52  2.00  Female     No  Thur   Lunch     2      14.52
131       20.27  2.83  Female     No  Thur   Lunch     2      20.27
194         NaN  4.00    Male    Yes  Thur   Lunch     2      14.19
101       15.38  3.00  Female    Yes   Fri  Dinner     2      15.38
82          NaN  1.83  Female     No  Thur   Lunch     1      16.61
49        18.04  3.00    Male     No   Sun  Dinner     2      18.04
171         NaN  3.16    Male    Yes   Sat  Dinner     2      14.19
107         NaN  4.29    Male    Yes   Sat  Dinner     2      14.19
1         10.34  1.66    Male     No   Sun  Dinner     3      10.34
225       16.27  2.50  Female    Yes   Fri   Lunch     2      16.27

In [188]:
df = sns.load_dataset("tips")
df.shape

(244, 7)

In [189]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [190]:
df[df['size'] >= ]b

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

In [198]:
df[df['size'] == 2].count()

total_bill    156
tip           156
sex           156
smoker        156
day           156
time          156
size          156
dtype: int64

In [199]:
df[df['size'] == 4].count()

total_bill    37
tip           37
sex           37
smoker        37
day           37
time          37
size          37
dtype: int64

In [193]:
df.groupby("size").filter(lambda x : x['size'].count() >= 30)['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

In [206]:
df_10 = sns.load_dataset("tips").sample(10, random_state=42)
grouped = df_10.groupby("sex")
# grouped 는 groupby 객체
grouped.groups

{'Male': [24, 6, 153, 211, 176, 192, 9], 'Female': [198, 124, 101]}

In [201]:
df_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [207]:
grouped.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_37384\2755795945.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [209]:
df_10.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [210]:
grouped.get_group('Female')

     total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [211]:
for i in grouped:
    print(i)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [219]:
for sex_group in grouped:
    print(f"그룹 오브젝트의 타입은 {type(sex_group)}")
    print(f"그룹 오브젝트의 길이는 {len(sex_group)}")
    
#     첫 번째 요소
    print(f"그룹 오브젝트의 이름은 {sex_group[0]}")
    print(sex_group)
    print("----------------------------")

그룹 오브젝트의 타입은 <class 'tuple'>
그룹 오브젝트의 길이는 2
그룹 오브젝트의 이름은 Male
('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
----------------------------
그룹 오브젝트의 타입은 <class 'tuple'>
그룹 오브젝트의 길이는 2
그룹 오브젝트의 이름은 Female
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)
----------------------------

In [222]:
labs = df_10.groupby(['sex', 'time'])
group_avg = labs.mean()
group_avg

C:\Users\starl\AppData\Local\Temp\ipykernel_37384\496817708.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group_avg = labs.mean()

               total_bill       tip      size
sex    time
Male   Lunch    28.440000  2.560000  2.000000
       Dinner   18.616667  2.928333  2.666667
Female Lunch    12.740000  2.260000  2.000000
       Dinner   15.380000  3.000000  2.000000

In [223]:
type(group_avg)

pandas.core.frame.DataFrame

In [224]:
type(group_avg.columns)

pandas.core.indexes.base.Index

In [225]:
group_avg.columns

Index(['total_bill', 'tip', 'size'], dtype='object')

In [226]:
group_avg.index

MultiIndex([(  'Male',  'Lunch'),
            (  'Male', 'Dinner'),
            ('Female',  'Lunch'),
            ('Female', 'Dinner')],
           names=['sex', 'time'])

In [227]:
df.groupby(['sex', 'time']).mean().reset_index()

C:\Users\starl\AppData\Local\Temp\ipykernel_37384\2848853033.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex', 'time']).mean().reset_index()

      sex    time  total_bill       tip      size
0    Male   Lunch   18.048485  2.882121  2.363636
1    Male  Dinner   21.461452  3.144839  2.701613
2  Female   Lunch   16.339143  2.582857  2.457143
3  Female  Dinner   19.213077  3.002115  2.461538

In [228]:
df.groupby(['sex','time'], as_index=False).mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_37384\54886949.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time'], as_index=False).mean()

      sex    time  total_bill       tip      size
0    Male   Lunch   18.048485  2.882121  2.363636
1    Male  Dinner   21.461452  3.144839  2.701613
2  Female   Lunch   16.339143  2.582857  2.457143
3  Female  Dinner   19.213077  3.002115  2.461538

In [231]:
import datetime
print(datetime.datetime.now())

2023-12-06 21:04:29.565537

In [232]:
print(datetime.datetime.today())

2023-12-06 21:05:14.061905

In [234]:
a = datetime.datetime(1970, 1, 1)
print(a)
b = datetime.datetime(2023, 12, 6, 14, 14)
print(b)

1970-01-01 00:00:00
2023-12-06 14:14:00

In [236]:
result = a - b
print(result)

-19698 days, 9:46:00

In [237]:
print(type(result))

<class 'datetime.timedelta'>

In [238]:
import pandas as pd
import os

In [243]:
df = pd.read_csv('../data/country_timeseries.csv')
df['Time'] = pd.to_datetime(df['Date'])

In [244]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  Time                 122 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(16), int64(1), object(1)
memory usage: 18.2+ KB

In [246]:
df = pd.DataFrame({
    'order_day' : ['01/01/15', '02/01/15', '03/01/15']
})
df

  order_day
0  01/01/15
1  02/01/15
2  03/01/15

In [248]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   order_day  3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [251]:
df['dt_d1'] = pd.to_datetime(df['order_day'], format='%d/%m/%y')
df['dt_d2'] = pd.to_datetime(df['order_day'], format='%m/%d/%y')
df['dt_d3'] = pd.to_datetime(df['order_day'], format='%y/%m/%d')
# 주의..! : Y 는 4자리의 년도 형식, y는 2자리의 년도 형식!

In [252]:
df

  order_day      dt_d1      dt_d2      dt_d3
0  01/01/15 2015-01-01 2015-01-01 2001-01-15
1  02/01/15 2015-01-02 2015-02-01 2002-01-15
2  03/01/15 2015-01-03 2015-03-01 2003-01-15

In [253]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   order_day  3 non-null      object
 1   dt_d1      3 non-null      datetime64[ns]
 2   dt_d2      3 non-null      datetime64[ns]
 3   dt_d3      3 non-null      datetime64[ns]
dtypes: datetime64[ns](3), object(1)
memory usage: 228.0+ bytes

In [256]:
now = datetime.datetime.now()
now.strftime('%Y-%m-%d')

'2023-12-06'

In [257]:
now.strftime('%H-%M-%S')

'21-54-57'

In [258]:
now.strftime('%Y-%m-%d:%H-%M-%S')

'2023-12-06:21-54-57'

In [265]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=['Date'])

In [263]:
df.head(3)

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN

In [266]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [270]:
data = pd.Series(['2018-05-16', '2018-05-17', '2018-05-18'])
date = pd.to_datetime(data)
print(date[0].year)
print(date[0].month)
print(date[0].day)

2018
5
16

In [274]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=['Date'])
df['year'], df['Month'], df['Days'] = df['Date'].dt.year, df['Date'].dt.month, df['Date'].dt.day
df[['Date', 'year', 'Month', 'Days']]

          Date  year  Month  Days
0   2015-01-05  2015      1     5
1   2015-01-04  2015      1     4
2   2015-01-03  2015      1     3
3   2015-01-02  2015      1     2
4   2014-12-31  2014     12    31
..         ...   ...    ...   ...
117 2014-03-27  2014      3    27
118 2014-03-26  2014      3    26
119 2014-03-25  2014      3    25
120 2014-03-24  2014      3    24
121 2014-03-22  2014      3    22

[122 rows x 4 columns]

In [275]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 21 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  year                 122 non-null    int64
 19  Month                122 non-null    int64
 20  Days                 122 non-null    int64
dtypes: datetime64[ns](1), float64(16), int64(4)
memory usage: 20.1 KB

In [276]:
df['Date'].min()

Timestamp('2014-03-22 00:00:00')

In [277]:
df['outbreak_d'] = df['Date'] - df['Date'].min()

In [279]:
df[['Date', 'Day', 'outbreak_d']]

          Date  Day outbreak_d
0   2015-01-05  289   289 days
1   2015-01-04  288   288 days
2   2015-01-03  287   287 days
3   2015-01-02  286   286 days
4   2014-12-31  284   284 days
..         ...  ...        ...
117 2014-03-27    5     5 days
118 2014-03-26    4     4 days
119 2014-03-25    3     3 days
120 2014-03-24    2     2 days
121 2014-03-22    0     0 days

[122 rows x 3 columns]

In [280]:
df = pd.read_csv('../data/banklist.csv')

In [281]:
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [282]:
df = pd.read_csv('../data/banklist.csv', parse_dates=['Closing Date', 'Updated Date'])

In [283]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 555 entries, 0 to 554
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              555 non-null    object
 1   City                   555 non-null    object
 2   ST                     555 non-null    object
 3   CERT                   555 non-null    int64
 4   Acquiring Institution  555 non-null    object
 5   Closing Date           555 non-null    datetime64[ns]
 6   Updated Date           555 non-null    datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 30.5+ KB

In [286]:
df['closing_quarter'] = df['Closing Date'].dt.quarter
df['closing_year'] = df['Closing Date'].dt.year

In [287]:
df[['Closing Date', 'clo']]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date,closing_quarter,closing_year
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,2017-12-15,2017-12-20,4,2017
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,2017-10-13,2017-10-20,4,2017
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",2017-05-26,2017-07-26,2,2017
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,2017-05-05,2017-07-26,2,2017
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,2017-04-28,2017-12-05,2,2017
5,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,2017-03-03,2017-05-18,1,2017
6,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,2017-01-27,2017-05-18,1,2017
7,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,2017-01-13,2017-05-18,1,2017
8,Allied Bank,Mulberry,AR,91,Today's Bank,2016-09-23,2017-09-25,3,2016
9,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,2016-08-19,2017-06-01,3,2016
10,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,2016-05-06,2016-09-06,2,2016
11,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,2016-04-29,2016-09-06,2,2016
12,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,2016-03-11,2017-03-13,1,2016
13,Hometown National Bank,Longview,WA,35156,Twin City Bank,2015-10-02,2018-01-12,4,2015
14,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,2015-10-02,2016-10-24,4,2015
15,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb",2015-07-10,2016-08-17,3,2015
16,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,2015-05-08,2016-07-12,2,2015
17,Doral Bank,San Juan,PR,32102,Banco Popular de Puerto Rico,2015-02-27,2015-05-13,1,2015
18,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,2015-02-13,2015-04-21,1,2015